{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v2.3.0", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "conv1/kernel", "shape": [3, 3, 1, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.9192117359123978, "scale": 0.007070859507018444, "original_dtype": "float32"}}, {"name": "conv1_bn/gamma", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.39330095052719116, "scale": 0.003558787878821878, "original_dtype": "float32"}}, {"name": "conv1_bn/beta", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5345016196662304, "scale": 0.004730102828904694, "original_dtype": "float32"}}, {"name": "conv1_bn/moving_mean", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.9296275082756493, "scale": 0.015688028522566254, "original_dtype": "float32"}}, {"name": "conv1_bn/moving_variance", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.08900061249732971, "scale": 0.004513211694418215, "original_dtype": "float32"}}, {"name": "conv_dw_1/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.9533613230667862, "scale": 0.008290098461450315, "original_dtype": "float32"}}, {"name": "conv_dw_1_bn/gamma", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.4360601007938385, "scale": 0.003803173116609162, "original_dtype": "float32"}}, {"name": "conv_dw_1_bn/beta", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1769095884818657, "scale": 0.007691721238341986, "original_dtype": "float32"}}, {"name": "conv_dw_1_bn/moving_mean", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.2413034635431628, "scale": 0.007216880601995132, "original_dtype": "float32"}}, {"name": "conv_dw_1_bn/moving_variance", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.054988205432891846, "scale": 0.007842837829215854, "original_dtype": "float32"}}, {"name": "conv_pw_1/kernel", "shape": [1, 1, 32, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.6069577698614084, "scale": 0.01108246737835454, "original_dtype": "float32"}}, {"name": "conv_pw_1_bn/gamma", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.219501331448555, "scale": 0.009780186005667144, "original_dtype": "float32"}}, {"name": "conv_pw_1_bn/beta", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.7536761900957892, "scale": 0.00655370600083295, "original_dtype": "float32"}}, {"name": "conv_pw_1_bn/moving_mean", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.6979208749883314, "scale": 0.012215258093441234, "original_dtype": "float32"}}, {"name": "conv_pw_1_bn/moving_variance", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.530289351940155, "scale": 0.04543536059996661, "original_dtype": "float32"}}, {"name": "conv_dw_2/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.6730829718066197, "scale": 0.005138037952722288, "original_dtype": "float32"}}, {"name": "conv_dw_2_bn/gamma", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.343238890171051, "scale": 0.0075702206761229275, "original_dtype": "float32"}}, {"name": "conv_dw_2_bn/beta", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.8746650097416896, "scale": 0.0078095090155508, "original_dtype": "float32"}}, {"name": "conv_dw_2_bn/moving_mean", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.9276611328125002, "scale": 0.01259909237132353, "original_dtype": "float32"}}, {"name": "conv_dw_2_bn/moving_variance", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.00869683176279068, "scale": 0.04160013651730968, "original_dtype": "float32"}}, {"name": "conv_pw_2/kernel", "shape": [1, 1, 64, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.4532769497703104, "scale": 0.012010553303886862, "original_dtype": "float32"}}, {"name": "conv_pw_2_bn/gamma", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.47253188490867615, "scale": 0.006729065787558462, "original_dtype": "float32"}}, {"name": "conv_pw_2_bn/beta", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.49647861368515916, "scale": 0.004728367749382468, "original_dtype": "float32"}}, {"name": "conv_pw_2_bn/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -3.1496447993259804, "scale": 0.024606599994734222, "original_dtype": "float32"}}, {"name": "conv_pw_2_bn/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.7927716970443726, "scale": 0.08114218104119394, "original_dtype": "float32"}}, {"name": "conv_dw_3/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.0221741947473264, "scale": 0.008177393557978611, "original_dtype": "float32"}}, {"name": "conv_dw_3_bn/gamma", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.4359748363494873, "scale": 0.007631720748602175, "original_dtype": "float32"}}, {"name": "conv_dw_3_bn/beta", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.941307217467065, "scale": 0.008557338340609682, "original_dtype": "float32"}}, {"name": "conv_dw_3_bn/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.7408674324260038, "scale": 0.009359502324870988, "original_dtype": "float32"}}, {"name": "conv_dw_3_bn/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.031694989651441574, "scale": 0.024883372716459573, "original_dtype": "float32"}}, {"name": "conv_pw_3/kernel", "shape": [1, 1, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.8621170791925168, "scale": 0.01311350055769378, "original_dtype": "float32"}}, {"name": "conv_pw_3_bn/gamma", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.41846492886543274, "scale": 0.005850934865427952, "original_dtype": "float32"}}, {"name": "conv_pw_3_bn/beta", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.8806899879492965, "scale": 0.006073724054822735, "original_dtype": "float32"}}, {"name": "conv_pw_3_bn/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -4.690547930025587, "scale": 0.03045810344172459, "original_dtype": "float32"}}, {"name": "conv_pw_3_bn/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 3.465695858001709, "scale": 0.13866682800592162, "original_dtype": "float32"}}, {"name": "conv_dw_4/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.7534045897278131, "scale": 0.00549930357465557, "original_dtype": "float32"}}, {"name": "conv_dw_4_bn/gamma", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.42153605818748474, "scale": 0.00681416532572578, "original_dtype": "float32"}}, {"name": "conv_dw_4_bn/beta", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.9663364840488807, "scale": 0.009860576367845722, "original_dtype": "float32"}}, {"name": "conv_dw_4_bn/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.428222012052349, "scale": 0.009987566517848594, "original_dtype": "float32"}}, {"name": "conv_dw_4_bn/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.007109414786100388, "scale": 0.01790850859354524, "original_dtype": "float32"}}, {"name": "conv_pw_4/kernel", "shape": [1, 1, 128, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.664957054456075, "scale": 0.013991235751731723, "original_dtype": "float32"}}, {"name": "conv_pw_4_bn/gamma", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.3159516453742981, "scale": 0.006431637324538885, "original_dtype": "float32"}}, {"name": "conv_pw_4_bn/beta", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.6280984345604391, "scale": 0.005368362688550762, "original_dtype": "float32"}}, {"name": "conv_pw_4_bn/moving_mean", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -6.833963618558996, "scale": 0.05062195273006664, "original_dtype": "float32"}}, {"name": "conv_pw_4_bn/moving_variance", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 2.2143356800079346, "scale": 0.2151954080544266, "original_dtype": "float32"}}, {"name": "conv_dw_5/depthwise_kernel", "shape": [3, 3, 256, 1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.8094696647980635, "scale": 0.00899410738664515, "original_dtype": "float32"}}, {"name": "conv_dw_5_bn/gamma", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.17707319557666779, "scale": 0.008659333984057108, "original_dtype": "float32"}}, {"name": "conv_dw_5_bn/beta", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5088245062267079, "scale": 0.005356047433965346, "original_dtype": "float32"}}, {"name": "conv_dw_5_bn/moving_mean", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.4201807141304015, "scale": 0.009282226889741186, "original_dtype": "float32"}}, {"name": "conv_dw_5_bn/moving_variance", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.007215432357043028, "scale": 0.015069992666808413, "original_dtype": "float32"}}, {"name": "conv_pw_5/kernel", "shape": [1, 1, 256, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.9152613939023486, "scale": 0.015445656402438295, "original_dtype": "float32"}}, {"name": "conv_pw_5_bn/gamma", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.41013452410697937, "scale": 0.0063743283935621675, "original_dtype": "float32"}}, {"name": "conv_pw_5_bn/beta", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5817010795368868, "scale": 0.004929670165566837, "original_dtype": "float32"}}, {"name": "conv_pw_5_bn/moving_mean", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -8.30866308773265, "scale": 0.06154565250172334, "original_dtype": "float32"}}, {"name": "conv_pw_5_bn/moving_variance", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 8.188582420349121, "scale": 0.21533662758621516, "original_dtype": "float32"}}, {"name": "conv_dw_6/depthwise_kernel", "shape": [3, 3, 256, 1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.7477776677000756, "scale": 0.005982221341600605, "original_dtype": "float32"}}, {"name": "conv_dw_6_bn/gamma", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.3979743421077728, "scale": 0.008695202832128487, "original_dtype": "float32"}}, {"name": "conv_dw_6_bn/beta", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.6564037379096536, "scale": 0.0072132278891170725, "original_dtype": "float32"}}, {"name": "conv_dw_6_bn/moving_mean", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.7371386135325713, "scale": 0.01206346259397619, "original_dtype": "float32"}}, {"name": "conv_dw_6_bn/moving_variance", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.01560712419450283, "scale": 0.01782264239793899, "original_dtype": "float32"}}, {"name": "conv_pw_6/kernel", "shape": [1, 1, 256, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -3.618699389812993, "scale": 0.021668858621634687, "original_dtype": "float32"}}, {"name": "conv_pw_6_bn/gamma", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.49318888783454895, "scale": 0.006052906256096036, "original_dtype": "float32"}}, {"name": "conv_pw_6_bn/beta", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.4658167895148782, "scale": 0.004852258224113315, "original_dtype": "float32"}}, {"name": "conv_pw_6_bn/moving_mean", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -11.191292687958363, "scale": 0.08542971517525468, "original_dtype": "float32"}}, {"name": "conv_pw_6_bn/moving_variance", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 9.569180488586426, "scale": 0.2838061874988032, "original_dtype": "float32"}}, {"name": "conv_dw_7/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.9197597354066138, "scale": 0.009385303422516467, "original_dtype": "float32"}}, {"name": "conv_dw_7_bn/gamma", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.5023906230926514, "scale": 0.006174205331241384, "original_dtype": "float32"}}, {"name": "conv_dw_7_bn/beta", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.9101997592869927, "scale": 0.006643793863408706, "original_dtype": "float32"}}, {"name": "conv_dw_7_bn/moving_mean", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.2617950963039024, "scale": 0.008356258915919883, "original_dtype": "float32"}}, {"name": "conv_dw_7_bn/moving_variance", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.012912091799080372, "scale": 0.009827167624790294, "original_dtype": "float32"}}, {"name": "conv_pw_7/kernel", "shape": [1, 1, 512, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.9259078399807799, "scale": 0.019068394455255246, "original_dtype": "float32"}}, {"name": "conv_pw_7_bn/gamma", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.5549755692481995, "scale": 0.004735272772171918, "original_dtype": "float32"}}, {"name": "conv_pw_7_bn/beta", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.4941633285260668, "scale": 0.004260028694190231, "original_dtype": "float32"}}, {"name": "conv_pw_7_bn/moving_mean", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -12.39191520915312, "scale": 0.07892939623664408, "original_dtype": "float32"}}, {"name": "conv_pw_7_bn/moving_variance", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 27.73004150390625, "scale": 0.3541376749674479, "original_dtype": "float32"}}, {"name": "conv_dw_8/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.9086685937993667, "scale": 0.009876832541297464, "original_dtype": "float32"}}, {"name": "conv_dw_8_bn/gamma", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.5101114511489868, "scale": 0.0059045955246570065, "original_dtype": "float32"}}, {"name": "conv_dw_8_bn/beta", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.667038932501101, "scale": 0.005955704754474116, "original_dtype": "float32"}}, {"name": "conv_dw_8_bn/moving_mean", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.19064962162691, "scale": 0.008819626826866, "original_dtype": "float32"}}, {"name": "conv_dw_8_bn/moving_variance", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.025578074157238007, "scale": 0.007924735107842614, "original_dtype": "float32"}}, {"name": "conv_pw_8/kernel", "shape": [1, 1, 512, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.5285139574724085, "scale": 0.012228111659779268, "original_dtype": "float32"}}, {"name": "conv_pw_8_bn/gamma", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.2783731520175934, "scale": 0.006098599410524555, "original_dtype": "float32"}}, {"name": "conv_pw_8_bn/beta", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.4714145496779797, "scale": 0.004285586815254361, "original_dtype": "float32"}}, {"name": "conv_pw_8_bn/moving_mean", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -12.67762726428462, "scale": 0.09055448045917586, "original_dtype": "float32"}}, {"name": "conv_pw_8_bn/moving_variance", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 31.901445388793945, "scale": 0.32685411490646066, "original_dtype": "float32"}}, {"name": "conv_dw_9/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.7398067990938823, "scale": 0.008312435944875081, "original_dtype": "float32"}}, {"name": "conv_dw_9_bn/gamma", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.506345272064209, "scale": 0.004473097651612525, "original_dtype": "float32"}}, {"name": "conv_dw_9_bn/beta", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.42263599564047416, "scale": 0.004593869517831241, "original_dtype": "float32"}}, {"name": "conv_dw_9_bn/moving_mean", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.2587875478407915, "scale": 0.008391916985605277, "original_dtype": "float32"}}, {"name": "conv_dw_9_bn/moving_variance", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.013197949156165123, "scale": 0.008034733032771186, "original_dtype": "float32"}}, {"name": "conv_pw_9/kernel", "shape": [1, 1, 512, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.9450709586049997, "scale": 0.013893363990035712, "original_dtype": "float32"}}, {"name": "conv_pw_9_bn/gamma", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.49998536705970764, "scale": 0.0054309451112560195, "original_dtype": "float32"}}, {"name": "conv_pw_9_bn/beta", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5342924482682172, "scale": 0.004686775862001905, "original_dtype": "float32"}}, {"name": "conv_pw_9_bn/moving_mean", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -16.31215252595789, "scale": 0.1032414716832778, "original_dtype": "float32"}}, {"name": "conv_pw_9_bn/moving_variance", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 34.508670806884766, "scale": 0.3751729179831112, "original_dtype": "float32"}}, {"name": "conv_dw_10/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.82837686141332, "scale": 0.009980444113413494, "original_dtype": "float32"}}, {"name": "conv_dw_10_bn/gamma", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.5846604704856873, "scale": 0.004101739443984686, "original_dtype": "float32"}}, {"name": "conv_dw_10_bn/beta", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.4730140774857764, "scale": 0.005768464359582639, "original_dtype": "float32"}}, {"name": "conv_dw_10_bn/moving_mean", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.2017559612498565, "scale": 0.008345527508679559, "original_dtype": "float32"}}, {"name": "conv_dw_10_bn/moving_variance", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.022073306143283844, "scale": 0.010332385085377038, "original_dtype": "float32"}}, {"name": "conv_pw_10/kernel", "shape": [1, 1, 512, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.3964390399409274, "scale": 0.012468205713758281, "original_dtype": "float32"}}, {"name": "conv_pw_10_bn/gamma", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.44016849994659424, "scale": 0.005425700019387638, "original_dtype": "float32"}}, {"name": "conv_pw_10_bn/beta", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5466110285590676, "scale": 0.004555091904658897, "original_dtype": "float32"}}, {"name": "conv_pw_10_bn/moving_mean", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -12.3114569495706, "scale": 0.08609410454245174, "original_dtype": "float32"}}, {"name": "conv_pw_10_bn/moving_variance", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 27.99112319946289, "scale": 0.33371012070599726, "original_dtype": "float32"}}, {"name": "conv_dw_11/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.8294658170026892, "scale": 0.009216286855585435, "original_dtype": "float32"}}, {"name": "conv_dw_11_bn/gamma", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.4993654489517212, "scale": 0.004223718830183441, "original_dtype": "float32"}}, {"name": "conv_dw_11_bn/beta", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3865989299381481, "scale": 0.004956396537668565, "original_dtype": "float32"}}, {"name": "conv_dw_11_bn/moving_mean", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.3900633954534343, "scale": 0.00885390697741041, "original_dtype": "float32"}}, {"name": "conv_dw_11_bn/moving_variance", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.013784490525722504, "scale": 0.009780604845168545, "original_dtype": "float32"}}, {"name": "conv_pw_11/kernel", "shape": [1, 1, 512, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.9302425590215946, "scale": 0.014404795216579063, "original_dtype": "float32"}}, {"name": "conv_pw_11_bn/gamma", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.3738150894641876, "scale": 0.0057245089727289535, "original_dtype": "float32"}}, {"name": "conv_pw_11_bn/beta", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.6011666872922112, "scale": 0.005515290709102855, "original_dtype": "float32"}}, {"name": "conv_pw_11_bn/moving_mean", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -14.217434490428252, "scale": 0.0861662696389591, "original_dtype": "float32"}}, {"name": "conv_pw_11_bn/moving_variance", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 35.738616943359375, "scale": 0.40134408988204656, "original_dtype": "float32"}}, {"name": "conv_dw_12/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.6871858145676407, "scale": 0.006803819946214265, "original_dtype": "float32"}}, {"name": "conv_dw_12_bn/gamma", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.48235592246055603, "scale": 0.004817153542649512, "original_dtype": "float32"}}, {"name": "conv_dw_12_bn/beta", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.42687563790994537, "scale": 0.005270069603826486, "original_dtype": "float32"}}, {"name": "conv_dw_12_bn/moving_mean", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.440074982362635, "scale": 0.01043532595914953, "original_dtype": "float32"}}, {"name": "conv_dw_12_bn/moving_variance", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.008631512522697449, "scale": 0.009729619879348604, "original_dtype": "float32"}}, {"name": "conv_pw_12/kernel", "shape": [1, 1, 512, 1024], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.963954871776057, "scale": 0.015711638974208457, "original_dtype": "float32"}}, {"name": "conv_pw_12_bn/gamma", "shape": [1024], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.37904492020606995, "scale": 0.006453559328528011, "original_dtype": "float32"}}, {"name": "conv_pw_12_bn/beta", "shape": [1024], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.8314467935001149, "scale": 0.00577393606597302, "original_dtype": "float32"}}, {"name": "conv_pw_12_bn/moving_mean", "shape": [1024], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -16.943517123951633, "scale": 0.12550753425149358, "original_dtype": "float32"}}, {"name": "conv_pw_12_bn/moving_variance", "shape": [1024], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 2.9589338302612305, "scale": 0.8204459583058077, "original_dtype": "float32"}}, {"name": "conv_dw_13/depthwise_kernel", "shape": [3, 3, 1024, 1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.8126087434151593, "scale": 0.007739130889668184, "original_dtype": "float32"}}, {"name": "conv_dw_13_bn/gamma", "shape": [1024], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.19052910804748535, "scale": 0.00829459732654048, "original_dtype": "float32"}}, {"name": "conv_dw_13_bn/beta", "shape": [1024], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.8816400214737538, "scale": 0.005724935204375024, "original_dtype": "float32"}}, {"name": "conv_dw_13_bn/moving_mean", "shape": [1024], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.9263617859167211, "scale": 0.007181099115633497, "original_dtype": "float32"}}, {"name": "conv_dw_13_bn/moving_variance", "shape": [1024], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 2.519650479371194e-07, "scale": 0.004794002928623491, "original_dtype": "float32"}}, {"name": "conv_pw_13/kernel", "shape": [1, 1, 1024, 1024], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.991101666057811, "scale": 0.014121288411757525, "original_dtype": "float32"}}, {"name": "conv_pw_13_bn/gamma", "shape": [1024], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.4902924597263336, "scale": 0.001290537679896635, "original_dtype": "float32"}}, {"name": "conv_pw_13_bn/beta", "shape": [1024], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.9441624879837036, "scale": 0.0024467749922883275, "original_dtype": "float32"}}, {"name": "conv_pw_13_bn/moving_mean", "shape": [1024], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -22.841099660536823, "scale": 0.10774103613460766, "original_dtype": "float32"}}, {"name": "conv_pw_13_bn/moving_variance", "shape": [1024], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 78.96685791015625, "scale": 0.5789656096813726, "original_dtype": "float32"}}, {"name": "conv_preds/kernel", "shape": [1, 1, 1024, 340], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.7965108441371542, "scale": 0.014487990678525438, "original_dtype": "float32"}}, {"name": "conv_preds/bias", "shape": [340], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.27069584867533514, "scale": 0.0034265297300675335, "original_dtype": "float32"}}]}]}